#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/vinnielee-io/bilh-tf-gh-actions-demo/runs/run-t1PESFev6J3E4WfS

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
random_id.demo_id: Refreshing state... [id=AfrM3g]
aws_key_pair.bilh_demo_key_pair: Refreshing state... [id=bilh-aws-demo-master-key]
data.aws_ami.amazon_linux2: Reading...
aws_vpc.tf_vpc: Refreshing state... [id=vpc-0e73f25dcf483982c]
data.aws_ami.amazon_linux2: Read complete after 0s [id=ami-0fe472d8a85bc7b0e]
aws_internet_gateway.tf_internet_gateway: Refreshing state... [id=igw-08fe94455d5e927b2]
aws_default_route_table.default_main: Refreshing state... [id=rtb-004475f2210f961d4]
aws_main_route_table_association.default_main: Refreshing state... [id=rtbassoc-069793d218e681b89]
aws_subnet.db: Refreshing state... [id=subnet-01357b030963a2d2d]
aws_subnet.app: Refreshing state... [id=subnet-0afe05bd6980c9f0e]
aws_default_security_group.default: Refreshing state... [id=sg-0bf99878259ff7795]
aws_subnet.web: Refreshing state... [id=subnet-022d00e503c1b878d]
aws_security_group.wordpress: Refreshing state... [id=sg-0f521f7cf194b5cdd]
aws_eip.tf_nat_gateway_eip: Refreshing state... [id=eipalloc-0101cd5a56ae29f3b]
aws_route_table.tf_routetable_web_public: Refreshing state... [id=rtb-01f1efa2e3e602eef]
aws_route_table_association.web_subnet: Refreshing state... [id=rtbassoc-0d592fa82d9b10421]
aws_instance.wordpress_instance: Refreshing state... [id=i-0da7c7e466890ffab]
aws_nat_gateway.tf_nat_gateway: Refreshing state... [id=nat-0afd1d7f6bae5dc24]
aws_route_table.tf_routetable_app_db_private: Refreshing state... [id=rtb-02106a1a824c6bd70]
aws_route_table_association.app_subnet: Refreshing state... [id=rtbassoc-0a8fba174426bdef0]
aws_route_table_association.db_subnet: Refreshing state... [id=rtbassoc-03bab45f6d0539654]
aws_instance.cli_created: Refreshing state... [id=i-09a9724c37ac32abe]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.instance_3 will be created
  + resource "aws_instance" "instance_3" {
      + ami                                  = "ami-0fe472d8a85bc7b0e"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "bilh-aws-demo-master-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-022d00e503c1b878d"
      + tags                                 = {
          + "Name" = "terraform-cloud"
        }
      + tags_all                             = {
          + "Name"        = "terraform-cloud"
          + "automation"  = "terraform-managed"
          + "environment" = "prod"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0f521f7cf194b5cdd",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @lee-vincent, Action: `pull_request`*